{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
        {
            "id": 0,
            "content": "[UNK]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 1,
            "content": "[PAD]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 2,
            "content": "[CLS]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 3,
            "content": "[SEP]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 4,
            "content": "[MASK]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        },
        {
            "id": 5,
            "content": "[BLANK]",
            "single_word": false,
            "lstrip": false,
            "rstrip": false,
            "normalized": false,
            "special": true
        }
    ],
    "normalizer": {
        "type": "NFD"
    },
    "pre_tokenizer": {
        "type": "Split",
        "pattern": {
            "String": ""
        },
        "behavior": "Isolated",
        "invert": false
    },
    "post_processor": {
        "type": "TemplateProcessing",
        "single": [
            {
                "SpecialToken": {
                    "id": "[CLS]",
                    "type_id": 0
                }
            },
            {
                "Sequence": {
                    "id": "A",
                    "type_id": 0
                }
            },
            {
                "SpecialToken": {
                    "id": "[SEP]",
                    "type_id": 0
                }
            }
        ],
        "pair": [
            {
                "SpecialToken": {
                    "id": "[CLS]",
                    "type_id": 0
                }
            },
            {
                "Sequence": {
                    "id": "A",
                    "type_id": 0
                }
            },
            {
                "SpecialToken": {
                    "id": "[SEP]",
                    "type_id": 0
                }
            },
            {
                "Sequence": {
                    "id": "B",
                    "type_id": 0
                }
            },
            {
                "SpecialToken": {
                    "id": "[SEP]",
                    "type_id": 0
                }
            }
        ],
        "special_tokens": {
            "[CLS]": {
                "id": "[CLS]",
                "ids": [
                    2
                ],
                "tokens": [
                    "[CLS]"
                ]
            },
            "[SEP]": {
                "id": "[SEP]",
                "ids": [
                    3
                ],
                "tokens": [
                    "[SEP]"
                ]
            }
        }
    },
    "decoder": null,
    "model": {
        "type": "WordPiece",
        "unk_token": "[UNK]",
        "continuing_subword_prefix": "##",
        "max_input_chars_per_word": 100,
        "vocab": {
            "[UNK]": 0,
            "[PAD]": 1,
            "[CLS]": 2,
            "[SEP]": 3,
            "[MASK]": 4,
            "[BLANK]": 5,
            "\n": 6,
            "\r": 7,
            " ": 8,
            "!": 9,
            ",": 10,
            ".": 11,
            "?": 12,
            "|": 13,
            "֫": 14,
            "֯": 15,
            "ְ": 16,
            "ֱ": 17,
            "ֲ": 18,
            "ֳ": 19,
            "ִ": 20,
            "ֵ": 21,
            "ֶ": 22,
            "ַ": 23,
            "ָ": 24,
            "ֹ": 25,
            "ֻ": 26,
            "ּ": 27,
            "ֽ": 28,
            "ׁ": 29,
            "ׂ": 30,
            "ׇ": 31,
            "א": 32,
            "ב": 33,
            "ג": 34,
            "ד": 35,
            "ה": 36,
            "ו": 37,
            "ז": 38,
            "ח": 39,
            "ט": 40,
            "י": 41,
            "ך": 42,
            "כ": 43,
            "ל": 44,
            "ם": 45,
            "מ": 46,
            "ן": 47,
            "נ": 48,
            "ס": 49,
            "ע": 50,
            "ף": 51,
            "פ": 52,
            "ץ": 53,
            "צ": 54,
            "ק": 55,
            "ר": 56,
            "ש": 57,
            "ת": 58
        },
        "language": "he"
    }
}